using Theatrical.Data.Models;

namespace Theatrical.Services.Curators;

public interface IRoleSimplifierCurator
{
    Dictionary<string, string> GetCorrectedRoleDictionary();
    List<Role> FindSimilarRoles(List<Role> roles);
    List<Role> MapWrongRolesToCorrect(List<Role> roles, Dictionary<string, string> dictionary);
}

public class RoleSimplifierCurator : IRoleSimplifierCurator
{
    
    public List<Role> FindSimilarRoles(List<Role> roles)
    {
        List<Role> similarRoles = new List<Role>();
        HashSet<Role> addedRoles = new HashSet<Role>(); // To track added role names

        // Set a threshold for similarity (adjust this as needed)
        int similarityThreshold = 3;

        for (int i = 0; i < roles.Count; i++)
        {
            Role role1 = roles[i];
            string roleName1 = CleanName(role1.Role1);

            // Check if the role has already been added to the list
            if (addedRoles.Contains(role1))
            {
                // Skip this role; it's already in the list
                continue;
            }

            for (int j = i + 1; j < roles.Count; j++)
            {
                Role role2 = roles[j];
                string roleName2 = CleanName(role2.Role1);

                int similarityScore = CalculateLevenshteinDistance(roleName1, roleName2);

                // If the similarity score is below the threshold, consider them similar
                if (similarityScore <= similarityThreshold)
                {
                    if (!addedRoles.Contains(role1))
                    {
                        similarRoles.Add(role1);
                        addedRoles.Add(role1);
                    }

                    addedRoles.Add(role2);
                    similarRoles.Add(role2);

                }
            }
        }

        return similarRoles;
    }

    
    public List<Role> MapWrongRolesToCorrect(List<Role> roles, Dictionary<string, string> dictionary)
    {
        var correctedRolesList = new List<Role>();

        foreach (var role in roles)
        {
            string roleName = CleanName(role.Role1);

            if (dictionary.ContainsKey(roleName))
            {
                Role correctedRole = new Role
                {
                    Id = role.Id,
                    SystemId = role.SystemId,
                    Timestamp = role.Timestamp,
                    Role1 = dictionary[roleName]
                };
                correctedRolesList.Add(correctedRole);
            }
        }

        return correctedRolesList;
    }
    
    private string CleanName(string name)
    {
        // Example: Convert to lowercase and remove extra spaces
        return name.ToLower().Trim();
    }
    
    private int CalculateLevenshteinDistance(string s1, string s2)
    {
        var distance = new int[s1.Length + 1, s2.Length + 1];

        for (int i = 0; i <= s1.Length; i++)
        {
            for (int j = 0; j <= s2.Length; j++)
            {
                if (i == 0)
                    distance[i, j] = j;
                else if (j == 0)
                    distance[i, j] = i;
                else
                    distance[i, j] = Math.Min(
                        Math.Min(distance[i - 1, j] + 1, distance[i, j - 1] + 1),
                        distance[i - 1, j - 1] + (s1[i - 1] == s2[j - 1] ? 0 : 1)
                    );
            }
        }

        return distance[s1.Length, s2.Length];
    }
    
    public Dictionary<string, string> GetCorrectedRoleDictionary()
    {
        
            // Creating a dictionary with the role names and their corrected versions
            //Wrong entry - Correct entry
            Dictionary<string, string> correctedRoleNames = new Dictionary<string, string>
            {
                { "σκηνικό", "σκηνικά" },
                { "- σκηνοθεσία", "σκηνοθεσία" },
                { "συγγραφή – σκηνοθεσία", "σκηνοθεσία" },
                { "συγγραφή - σκηνοθεσία", "σκηνοθεσία" },
                { "κουστούμι", "κοστούμια" },
                { "κουστούμια", "κοστούμια" },
                { "κοστούμι", "κοστούμια"},
                { "σκηνικα", "σκηνικά" },
                { "βοηθός", "βοηθοί σκηνοθέτη" },
                { "βοηθός σκηνοθέτη", "βοηθοί σκηνοθέτη" },
                { "βοηθός σκηνοθέτις", "βοηθοί σκηνοθέτη" },
                { "βοηθός σκηνοθετών", "βοηθοί σκηνοθέτη" },
                { "boηθός σκηνοθέτη", "βοηθοί σκηνοθέτη" },
                { "β’ βοηθός σκηνοθέτη", "βοηθοί σκηνοθέτη" },
                { "βοηθ. σκηνοθέτη", "βοηθοί σκηνοθέτη" },
                { "α΄ βοηθός σκηνοθέτη", "βοηθοί σκηνοθέτη" },
                { "α’ βοηθός σκηνοθέτη", "βοηθοί σκηνοθέτη" },
                { "β΄ βοηθός σκηνοθέτη", "βοηθοί σκηνοθέτη" },
                { "α’ βοηθός σκηνοθέτη", "βοηθοί σκηνοθέτη" },
                { "β’ βοηθοί σκηνοθέτη", "βοηθοί σκηνοθέτη" },
                { "β ́ βοηθός σκηνοθέτη", "βοηθοί σκηνοθέτη" },
                { "βοηθός σκηνοθέτη &κίνηση", "βοηθοί σκηνοθέτη" },
                { "βοηθός σκηνοθέτη - κίνηση", "βοηθοί σκηνοθέτη" },
                { "βοηθοί σκηνοθέτες", "βοηθοί σκηνοθέτη" },
                { "βοηθοί σκηνοθέτιδος", "βοηθοί σκηνοθέτη" },
                { "βοηθός σκηνοθέτης", "βοηθοί σκηνοθέτη" },
                { "βοηθός σκηνοθέτη", "βοηθοί σκηνοθέτη" },
                { "β.σκηνοθέτη", "βοηθοί σκηνοθέτη" },
                { "β. σκηνοθέτη", "βοηθοί σκηνοθέτη" },
                { "βοηθός φωτιστή", "βοηθοί σκηνοθέτη" },
                { "βοηθοί φωτιστή", "βοηθοί σκηνοθέτη" },
                { "βοηθός σκηνοθέτη – επιμέλεια κίνησης", "βοηθοί σκηνοθέτη" },
                { "βοηθός σκηνοθέτη/επιμέλεια κίνησης", "βοηθοί σκηνοθέτη" },
                { "βοηθοσ σκηνοθεσιασ", "βοηθοί σκηνοθέτη" },
                { "βοηθοί σκηνοθεσίας", "βοηθοί σκηνοθέτη" },
                { "βοηθ. σκηνοθεσίας", "βοηθοί σκηνοθέτη" },
                { "συνεργάτης σκηνοθέτη", "βοηθοί σκηνοθέτη" },
                { "συνεργάτης σκηνοθέτης", "βοηθοί σκηνοθέτη" },
                { "ηθοποιός", "ηθοποιοί" },
                { "παίζουν", "ηθοποιοί"},
                { "παίζουν", "ηθοποιοί"},   //different from above παίζουν for some reason.
                { "παίζουν οι", "ηθοποιοί"},
                { "ερμηνεύουν", "ηθοποιοί"},
                { "eρμηνεύουν", "ηθοποιοί"},
                { "ερμηνεύουν οι", "ηθοποιοί"},
                { "συγγραφέας", "συγγραφείς" },
                { "συγγραφή", "συγγραφείς" },
                { "δσυγγραφέας", "συγγραφείς" },
                { "σκηνοθεσία / δραματουργική επεξεργασία", "σκηνοθεσία - δραματουργική επεξεργασία" },
                { "σκηνοθεσία – δραματουργική επεξεργασία", "σκηνοθεσία - δραματουργική επεξεργασία" },
                { "σκηνοθεσία- δραματουργική επεξεργασία", "σκηνοθεσία - δραματουργική επεξεργασία" },
                { "σκηνοθεσία-δραματουργική επεξεργασία", "σκηνοθεσία - δραματουργική επεξεργασία" },
                { "σκηνοθεσία δραματουργική επεξεργασία", "σκηνοθεσία - δραματουργική επεξεργασία" },
                { "σκηνοθεσία, δραματουργική επεξεργασία", "σκηνοθεσία - δραματουργική επεξεργασία" },
                { "σκηνοθεσία-δραματουργία", "σκηνοθεσία - δραματουργική επεξεργασία" },
                { "σκηνοθεσία – δραματουργία", "σκηνοθεσία - δραματουργική επεξεργασία" },
                { "σκηνοθεσία - δραματουργία", "σκηνοθεσία - δραματουργική επεξεργασία" },
                { "πρωτότυπη μουσική*", "πρωτότυπη μουσική" },
                { "σκηνογραφία – κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνογραφία/κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικά και κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικό και κοστούμι", "σκηνικά & κοστούμια" },
                { "σκηνικό περιβάλλον", "σκηνικά & κοστούμια" },
                { "σκηνικά - κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικά/κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικό κοστούμι", "σκηνικά & κοστούμια" },
                { "σκηνικά-κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικά- κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικά – κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικό- κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικό/κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικά -κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικό-κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικά/κουστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικά κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικά, κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικά / κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικά-κουστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικά&κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικά|κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικό & κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικά - κωστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικό / κοστούμι", "σκηνικά & κοστούμια" },
                { "σκηνικό – κοστούμι", "σκηνικά & κοστούμια" },
                { "σκηνικά & κουστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικά - κουστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικός χώρος-κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικός χώρος – κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικός χώρος- κοστούμι", "σκηνικά & κοστούμια" },
                { "σκηνικός χώρος- κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνικός χώρος - κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνοθεσία - σκηνικά - κοστούμια", "σκηνικά & κοστούμια" },
                { "σκηνοθεσία/ σκηνικά- κοστούμια", "σκηνικά & κοστούμια" },
                { "επιμέλεια κοστουμιών", "σκηνικά & κοστούμια" },
                { "κοστούμια- σκηνικά", "σκηνικά & κοστούμια" },
                { "κουστούμια-σκηνικά", "σκηνικά & κοστούμια" },
                { "κοστούμια σκηνικά", "σκηνικά & κοστούμια" },
                { "κοστούμια – σκηνικά", "σκηνικά & κοστούμια" },
                { "κοστούμια - σκηνικά", "σκηνικά & κοστούμια" },
                { "σκηνική εγκατάσταση", "σκηνικά & κοστούμια" },
                { "φωτογραφία", "φωτογράφοι" },
                { "φωτογράφος", "φωτογράφοι" },
                { "φωτογραφίες", "φωτογράφοι" },
                { "φωτογραφίες", "φωτογράφοι" },
                { "φωτογραφια", "φωτογράφοι" },
                { "φωτογράφιση", "φωτογράφοι" },
                { "φωτογράφηση", "φωτογράφοι" },
                { "βοηθός φωτογράφου", "φωτογράφοι" },
                { "φωτογραφία-βίντεο", "φωτογράφοι" },
                { "φωτογραφία/βίντεο", "φωτογράφοι" },
                { "φωτογραφίες- βίντεο", "φωτογράφοι" },
                { "φωτογραφίες-βίντεο", "φωτογράφοι" },
                { "φωτογραφίες-art work", "φωτογράφοι" },
                { "φωτογραφίες - art work", "φωτογράφοι" },
                { "φωτογραφίες, artwork", "φωτογράφοι" },
                { "φωτογραφίες – βίντεο", "φωτογράφοι" },
                { "φωτογραφίες& βίντεο", "φωτογράφοι" },
                { "φωτογραφίες- bίντεο", "φωτογράφοι" },
                { "φωτογραφίες /βίντεο", "φωτογράφοι" },
                { "φωτογραφίες-video", "φωτογράφοι" },
                { "φωτογραφίες, video", "φωτογράφοι" },
                { "φωτογραφίες / video", "φωτογράφοι" },
                { "φωτογραφίες – video", "φωτογράφοι" },
                { "φωτογραφίες- video", "φωτογράφοι" },
                { "video design", "video design - προβολές" },
                { "video designer", "video design - προβολές" },
                { "video design – προβολές", "video design - προβολές" },
                { "video design-προβολές", "video design - προβολές" },
                { "προβολή/επικοινωνία", "υπεύθυνοι επικοινωνίας" },
                { "προβολή – επικοινωνία", "υπεύθυνοι επικοινωνίας" },
                { "προβολή-επικοινωνία", "υπεύθυνοι επικοινωνίας" },
                { "προβολή - επικοινωνία", "υπεύθυνοι επικοινωνίας" },
                { "υπεύθυνος επικοινωνίας", "υπεύθυνοι επικοινωνίας" },
                { "προβολής - επικοινωνία", "υπεύθυνοι επικοινωνίας" },
                { "προβολή και επικοινωνία", "υπεύθυνοι επικοινωνίας" },
                { "μουσική", "μουσικοί" },
                { "μουσικός", "μουσικοί" },
                { "moυσική", "μουσικοί" },
                { "απόδοση - σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "απόδοη-σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "απόδοση-σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "απόδοση και σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "μοντάζ", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "- μοντάζ", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κάμερα-μοντάζ", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κάμερα/μοντάζ", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κάμερα – μοντάζ", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κάμερα - μοντάζ", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κάμερες - μοντάζ", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κινηματογραφική σκηνοθεσία, μοντάζ", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κινηματογραφική σκηνοθεσία / μοντάζ", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "iδέα/σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "ιδέα/σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κείμενο/ σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κείμενα, σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κείμενο- σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κείμενο, σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κείμενο – σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κείμενο - σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κείμενο-σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κείμενο/σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "kείμενο / σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κείμενα & σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "επιμέλεια κίνησης", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "eπιμέλεια κίνησης", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "διασκευή-σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "διασκευή σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "διασκευή – σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "διασκευή / σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "διασκευή- σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "διασκευή/ σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "διασκευή - σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "διασκευή/σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "διασκευή και σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σκηνοθεσία- διασκευή", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σκηνοθεσία - διασκευή", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σκηνοθεσία & διασκευή", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σκηνοθεσία-διασκευή", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σκηνοθεσία/διασκευή", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σκηνοθεσία / διασκευή", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σκηνοθεσία & διασκευή κειμένου", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σκηνοθεσία-διασκευή κειμένου", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κείμενο/σκηνοθεσία/ερμηνεία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κείμενο/ σκηνοθεσία/ερμηνεία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σκηνοθεσία – μουσική επιμέλεια", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σκηνοθεσία – μουσική", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σκηνοθεσία-μουσική", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σκηνοθεσία-μουσική επιμέλεια", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σκηνοθεσία - μουσική επιμέλεια", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σκηνοθεσία, μουσική επιμέλεια", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "επιμέλεια σκηνικού", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "επιμέλεια σκηνικών", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σκηνοθεσία – ερμηνεία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σκηνοθεσία και ερμηνεία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "δραματουργική επεξεργασία - σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "δραματουργική επεξεργασία/σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "δραματουργική επεξεργασία – σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "επεξεργασία κειμένου - ερμηνεία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "επεξεργασία κειμένου – ερμηνεία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κατασκευή σκηνικών", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κατασκευή σκηνικού", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "επιμέλεια-διασκευή", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "προσαρμογή διαλόγων", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σχεδιασμός σκηνικών", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σχεδιασμός σκηνικού", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κάμερες", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κάμερα", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "ιδέα", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σενάριο / σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σενάριο- σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σενάριο, σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σύλληψη - σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σύλληψη / σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σύλληψη-σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "σύλληψη και σκηνοθεσία", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κείμενο a μέρους", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "κείμενο b μέρους", "κινηματογραφική σκηνοθεσία - μοντάζ" },
                { "ιστορια", "κινηματογραφική σκηνοθεσία - μοντάζ"},
                { "πρωταγωνιστούν (αλφαβητικά)", "πρωταγωνιστές"},
                { "πρωταγωνιστούν(αλφαβητικά)", "πρωταγωνιστές"},
                { "π​αιζουν (αλφαβητικά)", "πρωταγωνιστές" },
                { "παίζουν (αλφαβητικά)", "πρωταγωνιστές" },
                { "συμπαραγωγή", "παραγωγή" },
                { "παραγωγός", "παραγωγή" },
                { "βοηθοί παραγωγής", "παραγωγή" },
                { "βοηθός παραγωγής", "παραγωγή" },
                { "-υπεύθυνη παραγωγής", "παραγωγή" },
                { "υπεύθυνος παραγωγής", "παραγωγή" },
                { "βοηθός οργάνωσης παραγωγής", "παραγωγή" },
                { "βοηθ. οργάνωσης παραγωγής", "παραγωγή" },
                { "μουσική/ενορχήστρωση", "μουσική - ενορχήστρωση" },
                { "μουσική ενορχήστρωση", "μουσική - ενορχήστρωση" },
                { "μουσική – ενορχήστρωση", "μουσική - ενορχήστρωση" },
                { "μουσική επένδυση", "μουσική - ενορχήστρωση" },
                { "μουσικη επενδυση", "μουσική - ενορχήστρωση" },
                { "κείμενο", "κείμενα" },
                { "κείμενο", "κείμενα" },
                { "οργάνωση και εκτέλεση παραγωγής", "οργάνωση & εκτέλεση παραγωγής" },
                { "οργάνωση", "οργάνωση & εκτέλεση παραγωγής" },
                { "διοργάνωσης", "οργάνωση & εκτέλεση παραγωγής" },
                { "οργάνωσης παραγωγής", "οργάνωση & εκτέλεση παραγωγής" },
                { "οργάνωση παραγωγής", "οργάνωση & εκτέλεση παραγωγής" },
                { "οργάνωση-εκτέλεση παραγωγής", "οργάνωση & εκτέλεση παραγωγής" },
                { "οργάνωση / εκτέλεση παραγωγής", "οργάνωση & εκτέλεση παραγωγής" },
                { "οργάνωση/εκτέλεση παραγωγής", "οργάνωση & εκτέλεση παραγωγής" },
                { "οργάνωση - εκτέλεση παραγωγής", "οργάνωση & εκτέλεση παραγωγής" },
                { "διεύθυνση και οργάνωση παραγωγής", "οργάνωση & εκτέλεση παραγωγής" },
                { "διεύθυνση - οργάνωση παραγωγής", "οργάνωση & εκτέλεση παραγωγής" },
                { "διεύθυνση κι οργάνωση παραγωγής", "οργάνωση & εκτέλεση παραγωγής" },
                { "- δημόσιες σχέσεις / επικοινωνία", "δημόσιες σχέσεις & επικοινωνία" },
                { "δημόσιες σχέσεις / επικοινωνία", "δημόσιες σχέσεις & επικοινωνία" },
                { "δημόσιες σχέσεις – επικοινωνία", "δημόσιες σχέσεις & επικοινωνία" },
                { "δημόσιες σχέσεις - επικοινωνία", "δημόσιες σχέσεις & επικοινωνία" },
                { "δημόσιες σχέσεις-επικοινωνία", "δημόσιες σχέσεις & επικοινωνία" },
                { "δημόσιες σχέσεις- επικοινωνία", "δημόσιες σχέσεις & επικοινωνία" },
                { "δημόσιες σχέσεις/ επικοινωνία", "δημόσιες σχέσεις & επικοινωνία" },
                { "δημόσιες σχέσεις και επικοινωνία", "δημόσιες σχέσεις & επικοινωνία" },
                { "επικοινωνία – δημόσιες σχέσεις", "δημόσιες σχέσεις & επικοινωνία" },
                { "επικοινωνία - δημοσιές σχέσεις", "δημόσιες σχέσεις & επικοινωνία" },
                { "επικοινωνία- δημόσιες σχέσεις", "δημόσιες σχέσεις & επικοινωνία" },
                { "eπικοινωνία - δημόσιες σχέσεις", "δημόσιες σχέσεις & επικοινωνία" },
                { "επικοινωνία - δημόσιες σχέσες", "δημόσιες σχέσεις & επικοινωνία" },
                { "επικοινωνίας - δημόσιες σχέσεις", "δημόσιες σχέσεις & επικοινωνία" },
                { "επικοινωνία, δημόσιες σχέσεις", "δημόσιες σχέσεις & επικοινωνία" },
                { "επικοινωνία & δημόσιες σχέσεις", "δημόσιες σχέσεις & επικοινωνία" },
                { "επικοινωνία / δημόσιες σχέσεις", "δημόσιες σχέσεις & επικοινωνία" },
                { "επικοινωνία-δημόσιες σχέσεις", "δημόσιες σχέσεις & επικοινωνία" },
                { "επικοινωνία/δημόσιες σχέσεις", "δημόσιες σχέσεις & επικοινωνία" },
                { "επικοινωνία-προβολή", "δημόσιες σχέσεις & επικοινωνία" },
                { "επικοινωνία - προβολή", "δημόσιες σχέσεις & επικοινωνία" },
                { "επικοινωνία & προβολή", "δημόσιες σχέσεις & επικοινωνία" },
                { "επικοινωνία - προώθηση παράστασης", "δημόσιες σχέσεις & επικοινωνία" },
                { "επικοινωνία / προώθηση παράστασης", "δημόσιες σχέσεις & επικοινωνία" },
                { "hairstyle", "hair stylist" },
                { "hairstylist", "hair stylist" },
                { "hair styling", "hair stylist" },
                { "βοηθός σκηνογράφου", "βοηθοί σκηνογράφου" },
                { "βοηθός σκηνογράφος", "βοηθοί σκηνογράφου" },
                { "βοηθοί σκηνογράφοι", "βοηθοί σκηνογράφου" },
                { "- βοηθοί σκηνής", "βοηθοί σκηνογράφου" },
                { "βοηθοί σκηνής", "βοηθοί σκηνογράφου" },
                { "βοηθός σκηνής", "βοηθοί σκηνογράφου" },
                { "οδηγός σκηνής", "βοηθοί σκηνογράφου" },
                { "βοηθός σκηνογράφου – ενδυματολόγου", "βοηθοί σκηνογράφου" },
                { "βοηθός σκηνογράφου- ενδυματολόγου", "βοηθοί σκηνογράφου" },
                { "βοηθός σκηνογράφου– ενδυματολόγου", "βοηθοί σκηνογράφου" },
                { "βοηθός σκηνογράφου/ενδυματολόγου", "βοηθοί σκηνογράφου" },
                { "βοηθός σκηνογράφου, ενδυματολόγου", "βοηθοί σκηνογράφου" },
                { "βοηθός σκηνογράφου-ενδυματολόγου", "βοηθοί σκηνογράφου" },
                { "βοηθός σκηνογράφου - ενδυματολόγου", "βοηθοί σκηνογράφου" },
                { "βοηθός σκηνογράφου & ενδυματολόγου", "βοηθοί σκηνογράφου" },
                { "make up artist", "make-up artist" },
                { "makeup artist", "make-up artist" },
                { "κίνηση", "χορογράφοι"},
                { "kίνηση", "χορογράφοι"},
                { "κίνηση", "χορογράφοι"},
                { "κίνηση/χορογραφίες", "χορογράφοι" },
                { "χορογραφία", "χορογράφοι" },
                { "χορογράφος", "χορογράφοι" },
                { "κίνηση - χορογραφία", "χορογράφοι" },
                { "κίνηση-χορογραφία", "χορογράφοι" },
                { "κίνηση-χορογραφίες", "χορογράφοι" },
                { "βοηθός χορογράφου", "χορογράφοι" },
                { "χορογραφίες - κίνηση", "χορογράφοι" },
                { "χορογραφία - κίνηση", "χορογράφοι" },
                { "χορογραφία/κίνηση", "χορογράφοι" },
                { "σκηνοθεσία - χορογραφίες", "χορογράφοι" },
                { "σκηνοθεσία- χορογραφίες", "χορογράφοι" },
                { "σκηνοθεσία -χορογραφία", "χορογράφοι" },
                { "σκηνοθεσία, χορογραφία", "χορογράφοι" },
                { "επιμέλεια κίνησης/χορογραφία", "χορογράφοι" },
                { "επιμέλεια κίνησης – χορογραφία", "χορογράφοι" },
                { "επιμέλεια κίνησης-χορογραφίες", "χορογράφοι" },
                { "βοηθοί ενδυματολόγου", "ενδυματολόγοι" },
                { "βοηθός ενδυματολόγων", "ενδυματολόγοι" },
                { "βοηθός ενδυματολόγος", "ενδυματολόγοι" },
                { "σκηνογράφος/ενδυματολόγος", "ενδυματολόγοι" },
                { "σκηνογράφος , ενδυματολόγος", "ενδυματολόγοι" },
                { "σκηνογράφος / ενδυματολόγος", "ενδυματολόγοι" },
                { "σκηνογραφία – ενδυματολογία", "ενδυματολόγοι" },
                { "σκηνογραφία - ενδυματολογία", "ενδυματολόγοι" },
                { "σκηνογραφία - ενδηματολογία", "ενδυματολόγοι" },
                { "σκηνογραφία, ενδυματολογία", "ενδυματολόγοι" },
                { "επιστημονική συνεργάτης", "επιστημονικοί συνεργάτες" },
                { "επιστημονικός συνεργάτης", "επιστημονικοί συνεργάτες" },
                { "art direction", "art director" },
                { "σχεδιάστρια φωτισμών", "επιμέλεια φωτισμών" },
                { "σχεδιάστρια φωτισμού", "επιμέλεια φωτισμών" },
                { "σχεδιασμός φωτισμών", "επιμέλεια φωτισμών" },
                { "σχεδιασμός φωτισμού", "επιμέλεια φωτισμών" },
                { "σχεδιασμός φώτων", "επιμέλεια φωτισμών" },
                { "φωτισμός", "επιμέλεια φωτισμών" },
                { "φωτισμοί α’", "επιμέλεια φωτισμών" },
                { "φωτιστής", "επιμέλεια φωτισμών" },
                { "φωτισμοί", "επιμέλεια φωτισμών" },
                { "σκηνοθεσία-φωτισμοί", "επιμέλεια φωτισμών" },
                { "σκηνοθεσία - φωτισμοί", "επιμέλεια φωτισμών" },
                { "σκηνοθεσία- φωτισμοί", "επιμέλεια φωτισμών" },
                { "υπεύθυνη επικοινωνίας", "διεύθυνση επικοινωνίας" },
                { "κατασκευή κοστουμιών", "κατασκευές κοστουμιών" },
                { "κατασκευή κουστουμιών", "κατασκευές κοστουμιών" },
                { "κατασκευή κοστουμιού", "κατασκευές κοστουμιών" },
                { "σκηνογραφία", "σκηνογράφοι" },
                { "σκηνογράφος", "σκηνογράφοι" },
                { "τραγούδια", "ηχοληψία" },
                { "- τραγούδι", "ηχοληψία" },
                { "τραγούδι", "ηχοληψία" },
                { "τραγούδι παράστασης", "ηχοληψία" },
                { "μουσική πρωτότυπη", "ηχοληψία" },
                { "μουσική – ηχητική επιμέλεια", "ηχοληψία" },
                { "μουσική/ηχητική επιμέλεια", "ηχοληψία" },
                { "μουσική σύνθεση", "ηχοληψία" },
                { "μουσική- σύνθεση", "ηχοληψία" },
                { "μουσική σύνθεση-επιμέλεια", "ηχοληψία" },
                { "μουσική σύνθεση/επιμέλεια", "ηχοληψία" },
                { "μουσική-ηχητικό περιβάλλον", "ηχοληψία" },
                { "μουσικό - ηχητικό περιβάλλον", "ηχοληψία" },
                { "μουσική – ηχητικό περιβάλλον", "ηχοληψία" },
                { "ηχητικό περιβάλλον", "ηχοληψία" },
                { "ηχητική επιμέλεια", "ηχοληψία" },
                { "στίχοι", "ηχοληψία" },
                { "στιχοι", "ηχοληψία" },
                { "διασκευή - στίχοι", "ηχοληψία" },
                { "διασκευή – στίχοι", "ηχοληψία" },
                { "κείμενο-στίχοι", "ηχοληψία" },
                { "κείμενο – στίχοι", "ηχοληψία" },
                { "κείμενο - στίχοι", "ηχοληψία" },
                { "κείμενο – μουσική", "ηχοληψία" },
                { "κείμενο - μουσική", "ηχοληψία" },
                { "στίχοι τραγουδιών", "ηχοληψία" },
                { "στίχοι τραγουδιού", "ηχοληψία" },
                { "σχεδιασμός ήχου", "ηχοληψία" },
                { "σχεδιασμός ήχων", "ηχοληψία" },
                { "sound design", "ηχοληψία" },
                { "sounddesigner", "ηχοληψία" },
                { "sounddesign", "ηχοληψία" },
                { "μουσική/ηχητικά τοπία", "ηχοληψία" },
                { "μουσική – ηχητικά τοπία", "ηχοληψία" },
                { "μουσική επί σκηνής", "dj"},
                { "μουσικός επί σκηνής", "dj"},
                { "μουσικοί επί σκηνής", "dj"},
                { "μουσική/dj επί σκηνής", "dj"},
                { "ήχος | φώτα", "ήχος & φώτα" },
                { "ήχος-φώτα", "ήχος & φώτα" },
                { "ήχος – φώτα", "ήχος & φώτα" },
                { "ήχος/φώτα", "ήχος & φώτα" },
                { "φωτισμοί, ήχος", "ήχος & φώτα" },
                { "φωτισμοί- ήχοι", "ήχος & φώτα" },
                { "καλλιτεχνικός συνεργάτης", "καλλιτεχνικοί συνεργάτες" },
                { "καλλιτεχνική συνεργάτις", "καλλιτεχνικοί συνεργάτες" },
                { "σκηνοθεσία/καλλιτεχνική επιμέλεια", "καλλιτεχνικοί συνεργάτες" },
                { "φωτό", "φωτογραφίες & trailer" },
                { "φωτογραφίες-trailer", "φωτογραφίες & trailer" },
                { "φωτογραφίες/trailer", "φωτογραφίες & trailer" },
                { "φωτογραφίες - trailer", "φωτογραφίες & trailer" },
                { "trailer", "φωτογραφίες & trailer" },
                { "τrailer", "φωτογραφίες & trailer" },
                { "trailers", "φωτογραφίες & trailer" },
                { "φωτογραφίες – τρέιλερ", "φωτογραφίες & trailer" },
                { "φωτογραφίες-τρέιλερ", "φωτογραφίες & trailer" },
                { "φωτογραφίες/ τρέιλερ", "φωτογραφίες & trailer" },
                { "video trailer", "φωτογραφίες & trailer" },
                { "video - trailer", "φωτογραφίες & trailer" },
                { "video teaser", "φωτογραφίες & trailer" },
                { "teaser παράστασης", "φωτογραφίες & trailer" },
                { "trailer παράστασης", "φωτογραφίες & trailer" },
                { "δ/νση φωτογραφίας trailer", "φωτογραφίες & trailer" },
                { "δ/vση φωτογραφίας trailer", "φωτογραφίες & trailer" },
                { "σχεδιασμός αφίσας", "σχεδιασμός αφίσας & πρόγραμμα"},
                { "φωτογραφία αφίσας", "σχεδιασμός αφίσας & πρόγραμμα"},
                { "φωτογραφία – αφίσα", "σχεδιασμός αφίσας & πρόγραμμα"},
                { "αφίσα", "σχεδιασμός αφίσας & πρόγραμμα" },
                { "ανφίσα", "σχεδιασμός αφίσας & πρόγραμμα" },
                { "αφίσσα", "σχεδιασμός αφίσας & πρόγραμμα" },
                { "φωτογραφίες αφίσας", "σχεδιασμός αφίσας & πρόγραμμα" },
                { "αφίσα παράστασης", "σχεδιασμός αφίσας & πρόγραμμα" },
                { "σχεδιασμός αφίσας/προγράμματος", "σχεδιασμός αφίσας & πρόγραμμα" },
                { "σχεδιασμός αφίσας - προγράμματος", "σχεδιασμός αφίσας & πρόγραμμα" },
                { "αφίσα- πρόγραμμα", "σχεδιασμός αφίσας & πρόγραμμα" },
                { "αφίσα/πρόγραμμα", "σχεδιασμός αφίσας & πρόγραμμα" },
                { "αφίσα – πρόγραμμα", "σχεδιασμός αφίσας & πρόγραμμα" },
                { "μετάφραση / διασκευή", "μετάφραση - διασκευή" },
                { "μετάφραση/ διασκευή", "μετάφραση - διασκευή" },
                { "μετάφραση-διασκευή", "μετάφραση - διασκευή" },
                { "μετάφραση – σκηνοθεσία", "μετάφραση - διασκευή" },
                { "μετάφραση-σκηνοθεσία", "μετάφραση - διασκευή" },
                { "μετάφραση - σκηνοθεσία", "μετάφραση - διασκευή" },
                { "μετάφραση/σκηνοθεσία", "μετάφραση - διασκευή" },
                { "απόδοση-δραματουργία", "απόδοση - δραματουργία" },
                { "θεατρική διασκευή/σκηνοθεσία", "θεατρική διασκευή - σκηνοθεσία"},
                { "θεατρική διασκευή-σκηνοθεσία", "θεατρική διασκευή - σκηνοθεσία"},
                { "θεατρική διασκευή – σκηνοθεσία", "θεατρική διασκευή - σκηνοθεσία"},
                { "art work", "artwork" },
                { "γραφιστικά", "γραφίστες" },
                { "γραφικά", "γραφίστες" },
                { "graphic designer", "γραφίστες" },
                { "graphic design", "γραφίστες" },
                { "graphics design", "γραφίστες" },
                { "γραφιστική επιμέλεια", "γραφίστες" },
                { "σχεδιασμός γραφικών", "γραφίστες" },
                { "σχεδιασμός γραφιστικών", "γραφίστες" },
                { "βοηθός σκηνοθέτης – φωτογραφίες – trailer – γραφιστικά", "γραφίστες" },
                { "βοηθός σκηνοθέτης – φωτογραφίες & trailer – γραφιστικά", "γραφίστες" },
                { "voice over", "voice-over" },
                { "μετάφραση στα ελληνικά", "μεταφραστές" },
                { "επιλογή δραματολογίου-μετάφραση", "μεταφραστές" },
                { "επιλογή δραματολογίου–μετάφραση", "μεταφραστές" },
                { "επιλογή δραματολογίου - μετάφραση", "μεταφραστές" },
                { "μετάφραση αρχικού κειμένου", "μεταφραστές" },
                { "μετάφραση αγγλικού κειμένου", "μεταφραστές" },
                { "μακιγιάζ φωτογράφησης", "μακιγιάζ φωτογράφισης" },
                { "χειριστής ήχου – φώτων", "χειριστής ήχου - φώτων" },
                {
                    "η πρώτη του επαγγελματική του εμφάνιση ήταν στο έργο του ζ. φεϋντώ ράφτης κυριών (στο ρόλο του υπηρέτη ετιέν), το 1994. ακολούθησαν οι θεατρικές παρασ",
                    "bad role"
                },
                { "creativeagency", "creative agency"},
                { "social media -διαφήμιση", "social media - διαφήμιση"},
                { "social media – διαφήμιση", "social media - διαφήμιση"},
                { "κιθαρα α", "κιθάρα"},
                { "κιθαρα β", "κιθάρα"}
            };
            
            return correctedRoleNames;
    }
    
    
}